%%%Υπολογίζει τον μετασχηματισμό Fourier του διακριτού σήματος χρόνου
%%%x(n)=(0.5)^n*u(n)
% Αναλυτική επεξήγηση του προγράμματος:

%Διαγραφή όλων των μεταβλητών από workspace, των γραφικών και καθαρισμός
%του παράθυρου εντολών.
clear all;
close all;
clc;

M=500; n1=0; n2=1000; %Σημεία συχνοτήτων 501 σημεία.
n0=0; %Αρχικοπίηση χρόνου
k=[0:1:M]; %Οι δείκτες της συχνότητας
[u_step,n]=step_f(n0,n1,n2);
x=(0.5.^n).*u_step;
nT=n.'; %μετατροπή του διανύσματος από γραμμή σε στήλη
arg1=-i*pi/M; %ορίζει τη σταθερά 
X=x*((exp(arg1)).^(nT*k)); %Με πράξεις πινάκων υπολογίζει τους εκθετικούς όρους και πολλαπλασιάζει με χ

magX=abs(X); %Υπολογισμός μέτρου.
angX=angle(X); %Υπολογισμός φάσης.
realX=real(X); %Υπολογισμός πραγματικού μέρους.
imagX=imag(X);%Υπολογισμός φανταστικού μέρους.

%Για τα γραφήματα (η επεξήγηση θεωρείται περιττή):
figure(1);
subplot(2,2,1);
plot(k,magX);
xlabel('k');
ylabel('Magnitude');
title('Magnitude Part');
axis([0 M min(magX) max(magX)]);

subplot(2,2,3);
plot(k,angX);
xlabel('k');
ylabel('Radians');
title('Angle Part');
axis([0 M min(angX) max(angX)]);

subplot(2,2,2);
plot(k,realX);
xlabel('k');
ylabel('Real');
title('Real Part');
axis([0 M min(realX) max(realX)]);

subplot(2,2,4);
plot(k,imagX);
xlabel('k');
ylabel('Imaginary');
title('Imaginary Part');
axis([0 M min(imagX) max(imagX)]);
print -dpdfprogr24;

%%%Απαντήσεις στις ερωτήσεις του οδηγού:
%1) αναλύθηκε
%2) μηδενίζεται για n<0 επομένως θα ήταν αχρείαστη υπολογιστική φόρτωση του
%προγράμματός μας.
%3) Θα έπρεπε να χρησιμοποιήσουμε τιμές n<=0 ώστε u(-n)=1.
%4) Η ακολουθία δεν συγκλίνει. Θα έπρεπε να χρησιμοποιηθεί εναλλακτικά ο
%μετασχηματισμός z.
%5) Τα γραφήματα είναι όμοια αφού παρά τις διαφορετικές μεθόδους που
%ακολουθήσαμε αναμέναμε την ίδια συμπεριφορά της ακολουθίας κατά τον
%μετασχηματισμό Fourier. Οι διαφορές επίσης, λόγω ακρίβειας είναι
%αμελητέες.
