%καθαρισμός μνήμης, κλείσιμο παραθύρων γραφικών και διαγραφή προηγούμενων
%μεταβλητών:
clear all;
clc;
close all;

x=[3 11 7 0 -1 4 2]; %αρχικό σήμα πληροφορίας μέσω διακριτής ακολουθίας
nx=[-3:1:3]; %οι χρόνοι του σήματος -3<=n<=3
[y1,ny1]=shift_f(x,nx,2); %δημιουργία μετατοπισμένου σήματος y1=x(n-2)
w=randn(1,length(y1)); %δημιουργία θορύβου w gaussian κατανομής με μέση μηδενική τιμή και διακύμανση 1.
nw=ny1; %κοινοί χρόνοι για θόρυβο και ny1
[y2,ny2]=add_f(y1,ny1,w,nw); %πρόσθεση των δύο σημάτων με κοινούς χρόνους.
[x1,nx1]=rev_f(x,nx); %αναστροφή του σήματος x και των χρόνων nx

%Υπολογίζει την ετεροσυσχέτηση μέσω της συνέλιξης των y2(n) και x1(-n)
[rxy,nrxy]=conv_f(y2,ny2,x1,nx)

%Σχεδίαση γραφημάτων η οποία έχει αναλυθεί και σε προηγούμενες ασκήσεις.
figure(1);
%πάνω αριστερά το x(n)
subplot(221);
stem(nx,x);
title('x(n)');
xlabel('n');
ylabel('x(n)');
%πάνω δεξιά το y(n) με μετατόπιση και θόρυβο
subplot(222);
stem(ny2,y2);
title('y(n)=x(n-2)+w(n)');
xlabel('n');
ylabel('y(n)');
%κάτω γράφημα της ετεροστχέτησης
subplot(212);
stem(nrxy,rxy);
title('r_{x,y}');
xlabel('n');
ylabel('r_{x,y}(n)');
%αποθήκευση γραφιμάτων
print -dpdf progr19;

%Για τις γραμμές από τον εργαστηριακό οδηγό που ζητούνται:
% στην γραμμή 8 έχουμε δημιουργία θορύβου w gaussian κατανομής με μέση
% μηδενική τιμή και διακύμανση 1 όπως ζητάει η άσκηση.