%y(n)=x(-n)
function[y,ny]=rev_f(x,nx);

in_matr=[x;nx]; %Δημιουργία πίνακα 2 γραμμών n και nx.
fin_matr=fliplr(in_matr); %Αναστροφή του πίνακα οριζόντια.
y=fin_matr(1,:); %Επιστροφή της πρώτης γραμμής του fin_matr.
ny=-fin_matr(2,:); %Επιστροφή της δευτερης γραμμής του fin_matr πολλαπλασιασμένη με -1.

%Για τις γραμμές από τον εργαστηριακό οδηγό που ζητούνται:
%Η γραμμή 5 πραγματοποιεί οριζόντια αναστροφή στον δοσμένο πίνακα. Για
%παράδειγμα στον πίνακα:
%[1 0 -1]                   [-1 0 1]
%[7 11 3] τον αντιστρέφει ως[7 11 3]

%Η γραμμή 6 παίρνει την πρώτη γραμμή του και την θέτει ως πίνακα y
%H γραμμή 7 ορίζει τον πίνακα ny=-[7,11,3]=[-7,-11,-3].
