%y(n)=x1(n)+x2(n)
function[y,ny]=add_f(x1,nx1,x2,nx2);

n_min=min(min(nx1),min(nx2)); %μικρότερη χρονική στιγμή από τα δύο σήματα για αρχή του νέου διαστήματος.
n_max=max(max(nx1),max(nx2)); %μεγαλύτερη χρονική στιγμή από τα δύο σήματα για τέλος του νέου διαστήματος.
ny=[n_min:1:n_max]; %νέος πίνακας για τον χρόνο.

%Δημιουργία δύο πινάκων με μηδενικά μήκους ny.
new_x1=zeros(1,length(ny)); 
new_x2=zeros(1,length(ny));

%Εντοπίζουμε τις θέσεις στο ny που αντιστοιχούν στις διάρκειες των x1 και x2
new_x1(find((ny>=min(nx1))&(ny<=max(nx1))==1))=x1;
new_x2(find((ny>=min(nx2))&(ny<=max(nx2))==1))=x2;

y=new_x1+new_x2; %Προσθέτουμε τα δύο σήματα που έχουν <<ευθυγραμμιστεί>>.

%Για τις γραμμές από τον εργαστηριακό οδηγό που ζητούνται:
%Στις γραμμές 7 έως 10 του οδηγού δημιουργούντε πίνακες με μηδενικά ίσοι με
%το μήκος του ny. Επειτα βρίσκει ποια σημεία του ny ανήκουν στους χρόνους
%του x1 (μεταξύ max(nx1) και max(nx2) και σε αυτές τις θέσεις αντιγράφει το
%x1. Όμοια με το x2.
