%οι απαντήσεις στις ερωτήσεις που είναι όμοιες στα δύο προγράμματα έχουν
%απαντηθεί μόνο στο πρόγραμμα 2α.
close all; % Κλείνει όλα τα γραφικά παράθυρα
clear all; % Διαγράφει όλες τις μεταβλητές από το workspace
clc;  % Καθαρίζει το παράθυρο εντολών

Dt=5e-5;  % Βήμα χρόνου για αναλογικό σήμα Δt=50 μsec
t=-5e-3:Dt:5e-3;  % Άξονας χρόνου -5msec<=t<=5msec
x=exp(-1000*abs(t)); % Αναλογικό σήμα x(t) σύμφωνα με την εκφώνηση

%Δειγματοληψία σήματος:
Ts=2e-4; %Περίοδος δειγματοληψίας 0,0002s
n=-25:1:25; % Δείκτες δειγματοληψίας 51 χωράνε από -5msec έως 5msec με βήμα 0,0002s.
x_d=exp(-1000*abs(n*Ts)); %Σήμα από δειγματοληψία χ(nTs)

%Για τον υπολογισμό του ολοκληρώματος αριθμητικά σαν άθροισμα:
iter_max=500;
iter=0:1:iter_max; %χωρισμός του φάσματος σε 501 σημεία από 0->500.
w=(iter/iter_max)*pi; %κατασκευή του πίνακα με τα Ω.
X_d=x_d*exp(-i*n'*w); %αρηθμητικός υπολογισμός του ολοκληρώματπς Fourier με πολ/μό πινάκων.
X_d=real(X_d); %Παίρνουμε την πραγματικό μέρος.

%Δημιουργία συμμετρικού φάσματος και για τις αρνητικές τιμές w:
%αυτό προκύπτει 
w=[-fliplr(w),w(2:iter_max+1)]; %δημιουργία σηυμμετρικού άξονα συχνοτήτων
X_d=[fliplr(X_d),X_d(2:iter_max+1)]; %δημιουργία συμμετρικού φάσματος fourier που να αντιστοιχεί στις συμμετρικές συχνότητες.

%Σχεδίαση γραφημάτων (έχει αναλυθεί σε προηγούμενα προγράμματα):
figure(1);

subplot(2,1,1); %πλαίσιο 2γραμμών 1 στήλης και 1ο γράφημα
plot(1000*t,x); %χρόνος σε msec και χ το αναλογικό σήμα
xlabel('t[msec]'); %ετικέςτα άξονα χ
ylabel('x(t)'); %ετικέτα άξονα y
title('Discrete signal (Ts=0.2msec)');
hold on; %κρατάει το ράφημα για να προσθέσουμε και το stem
stem(n*Ts*1000,x_d); %προσθήκη και των διακριτών σημείων κατά την δειγματοληψία
hold off; %απενεργοποίηση του hold off
subplot(2,1,2);%2o γράφημα
plot(w/pi,X_d); %σχεδιάζιει τον fourier μετασχηματισμό της συχνότητας προς π
xlabel('f[\pi units]');
ylabel('X_1(i\Omega)');
title('Discrete-time Fourier transform');

print -dpdf progr32; 
